In [1]:
import pandas as pd
import numpy as np
import plotly.express as px
from datetime import datetime, timedelta

### 데이터 로드

In [2]:
df = pd.read_csv(r'data-files\08-conversion.csv')
df.head()

   transaction_id    apply_at      pay_at
0            2560  2023-01-01  2023-01-08
1            2844  2023-01-01  2023-01-06
2            1878  2023-01-01         NaN
3            2374  2023-01-01  2023-01-02
4            3923  2023-01-01  2023-01-08

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2170 entries, 0 to 2169
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  2170 non-null   int64
 1   apply_at        2170 non-null   object
 2   pay_at          1062 non-null   object
dtypes: int64(1), object(2)
memory usage: 51.0+ KB

In [4]:
# 날짜 데이터 타입 변환
df['apply_at'] = pd.to_datetime(df['apply_at'])
df['pay_at'] = pd.to_datetime(df['pay_at'])

In [7]:
# apply 와 pay 사이 시간간격 분포 (하루기준 계산)
df['td'] = (df['pay_at'] - df['apply_at']).dt.total_seconds() / (3600*24)

In [8]:
df['td'].describe()

count    1062.000000
mean        8.524482
std         8.241573
min         0.000000
25%         2.000000
50%         6.000000
75%        12.000000
max        43.000000
Name: td, dtype: float64

In [10]:
df.head()

   transaction_id   apply_at     pay_at   td
0            2560 2023-01-01 2023-01-08  7.0
1            2844 2023-01-01 2023-01-06  5.0
2            1878 2023-01-01        NaT  NaN
3            2374 2023-01-01 2023-01-02  1.0
4            3923 2023-01-01 2023-01-08  7.0

In [12]:
df[~df['pay_at'].isna()].shape[0]

1062